# Pandas

**Pandas Seriler vs Numpy Array**

Pandas serilerinde index değerlerini kullanıcı belirleyebiliyor.

In [ ]:
import pandas as pd

In [ ]:
a = pd.Series([1,2,3,4,5], dtype = "float32" )

In [ ]:
a

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float32

In [ ]:
a.axes

[RangeIndex(start=0, stop=5, step=1)]

In [ ]:
indeksliSeri = pd.Series([1,2,3,4,5], index = ["a","b","c","d","e"])

In [ ]:
indeksliSeri

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
type(indeksliSeri)

pandas.core.series.Series

In [ ]:
indeksliSeri.axes

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object')]

In [ ]:
indeksliSeri.dtype

dtype('int64')

In [ ]:
indeksliSeri.values

array([1, 2, 3, 4, 5])

In [ ]:
indeksliSeri.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
indeksliSeri.head(2)

a    1
b    2
dtype: int64

In [ ]:
indeksliSeri.head(10)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
indeksliSeri.tail(2)

d    4
e    5
dtype: int64

In [ ]:
indeksliSeri[:"c"] #obje indekslemesi ->

a    1
b    2
c    3
dtype: int64

In [ ]:
indeksliSeri[:2]

a    1
b    2
dtype: int64

In [ ]:
indeksliSeri

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
indeksliSeri.loc[:2]

In [ ]:
indeksliSeri.loc[:"d"]

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
indeksliSeri.iloc[:2]  #integer based location

a    1
b    2
dtype: int64

In [ ]:
indeksliSeri.iloc[:"c"]

In [ ]:
sozlukluSeri = pd.Series({"index1":1, "index2":2, "index3":3})

In [ ]:
sozlukluSeri

index1    1
index2    2
index3    3
dtype: int64

In [ ]:
indeksliSeri

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
concatted_ps = pd.concat([indeksliSeri, sozlukluSeri])
concatted_ps

a         1
b         2
c         3
d         4
e         5
index1    1
index2    2
index3    3
dtype: int64

In [ ]:
s = {"a":2, "b":3}
s.items()

dict_items([('a', 2), ('b', 3)])

In [ ]:
concatted_ps.items()

In [ ]:
list(concatted_ps.items())

[('a', 1),
 ('b', 2),
 ('c', 3),
 ('d', 4),
 ('e', 5),
 ('index1', 1),
 ('index2', 2),
 ('index3', 3)]

**pandas dataframe oluşturma**

In [ ]:
pd.DataFrame([1,2,3,4,5])

   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
import numpy as np
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [ ]:
sozluk={"Yaş":s1,"Boy":s2,"Kilo":s3}

sdf=pd.DataFrame.from_dict(sozluk)
sdf

   Yaş  Boy  Kilo
0    5    8     7
1    4    2     8
2    4    4     9
3    7    4     7
4    3    7     5

In [ ]:
sdf[0:1]

   Yaş  Boy  Kilo
0    5    8     7

In [ ]:
sdf.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
sdf.index = ["a","b","c","d","e"]

In [ ]:
sdf

   Yaş  Boy  Kilo
0    5    8     7
1    4    2     8
2    4    4     9
3    7    4     7
4    3    7     5

In [ ]:
sdf.reset_index(inplace=True)

In [ ]:
yeni_sdf = sdf.reset_index(drop = True)

In [ ]:
yeni_sdf

   Yaş  Boy  Kilo
0    5    8     7
1    4    2     8
2    4    4     9
3    7    4     7
4    3    7     5

In [ ]:
yeni_sdf.drop(columns = ["index"],axis=1, inplace=True)

In [ ]:
sdf.reset_index(inplace=True)

In [ ]:
yeni_sdf.drop("index",axis=1,inplace=True) #inplace ile kalıcı değişiklik yapar.    axis=0->Satır bazında    axis=1 *> Sütun(kolon) bazında

In [ ]:
yeni_sdf.drop(columns=["a","b"],axis=1,inplace=True)

In [ ]:
if "Kilo" in yeni_sdf:
  print("Evet")

Evet

In [ ]:
yeni_sdf

   Yaş  Boy  Kilo
0    5    8     7
1    4    2     8
2    4    4     9
3    7    4     7
4    3    7     5

In [ ]:
yeni_sdf["jsaghdjhasd"]

In [ ]:
yeni_sdf["RY2"] = 7

In [ ]:
yeni_sdf["Ruh Yaşı"] = yeni_sdf["Yaş"]*2

In [ ]:
yeni_sdf["Cinsiyet"] = "Kadın"

In [ ]:
yeni_sdf["CinsiyetBelirtec"] = yeni_sdf["Cinsiyet"] == "Kadın"

In [ ]:
yeni_sdf["f"] = yeni_sdf["c"]**2
yeni_sdf

In [ ]:
yeni_sdf["z"]=yeni_sdf["f"]+yeni_sdf["c"]
yeni_sdf

**Loc ve Iloc**

Gözlem ve Değişken Seçimi

Gözlem -> Veri setimizdeki her bir satır

Değişken -> Veri setimizdeki her bir sütun

In [ ]:
new_arr = np.random.randint(1,20,size=(10,2))

df = pd.DataFrame(new_arr,columns=["a","b"])
df

    a   b
0   6  14
1  17  17
2  11  17
3  18  14
4  11  14
5  13   3
6   5   4
7   5   5
8  13  10
9   2  18

In [ ]:
df.axes

[Index(['var1', 'var2', 'var3', 'var4', 'var5', 'var6', 'var7', 'var8', 'var9',
        'var10'],
       dtype='object'), Index(['a', 'b'], dtype='object')]

In [ ]:
#loc: DataFrame'in indesklerinin  tanımlandığı şekil ile seçim yapmak için kullanılır
df.loc[0:2]

In [ ]:
df.index = ["var1","var2","var3","var4","var5","var6","var7","var8","var9","var10"]

In [ ]:
df.loc[0:2]

In [ ]:
df.loc["var1":"var7"]

       a   b
var1   6  14
var2  17  17
var3  11  17
var4  18  14
var5  11  14
var6  13   3
var7   5   4

In [ ]:
df.loc["var1":"var3","a"].values

array([ 6, 17, 11])

In [ ]:
print(df.loc["var1":"var7","a":"b"])
print(type(df.loc["var1":"var7","b"]))

       a   b
var1   6  14
var2  17  17
var3  11  17
var4  18  14
var5  11  14
var6  13   3
var7   5   4
<class 'pandas.core.series.Series'>

In [ ]:
#iloc (integer-location): Alışılmış indexleme mantığıyla seçim yapmak için kullanılır
df.iloc["var1":"var7"]

In [ ]:
df.iloc[0:7,"a"]

In [ ]:
df.iloc[0:7,0:1]

       a
var1   6
var2  17
var3  11
var4  18
var5  11
var6  13
var7   5

In [ ]:
df.iloc[0:7][]

array([ 6, 17, 11, 18, 11, 13,  5])

**Koşullar**

In [ ]:
df

        a   b
var1    6  14
var2   17  17
var3   11  17
var4   18  14
var5   11  14
var6   13   3
var7    5   4
var8    5   5
var9   13  10
var10   2  18

In [ ]:
df.a>10

var1     False
var2      True
var3      True
var4      True
var5      True
var6      True
var7     False
var8     False
var9      True
var10    False
Name: a, dtype: bool

In [ ]:
df[df.a > 10]

       a   b
var2  17  17
var3  11  17
var4  18  14
var5  11  14
var6  13   3
var9  13  10

In [ ]:
df.a>10

In [ ]:
new_df = df[df.a>10].reset_index(drop = True)
new_df

    a   b
0  17  17
1  11  17
2  18  14
3  11  14
4  13   3
5  13  10

In [ ]:
df

        a   b
var1    6  14
var2   17  17
var3   11  17
var4   18  14
var5   11  14
var6   13   3
var7    5   4
var8    5   5
var9   13  10
var10   2  18

In [ ]:
(df.a > 5) & (df.b <10)

var1     False
var2     False
var3     False
var4     False
var5     False
var6      True
var7     False
var8     False
var9     False
var10    False
dtype: bool

In [ ]:
df[(df.a > 5) & (df.b < 10)]

       a  b
var6  13  3

In [ ]:
df[df.a > 15]["b"]

var2    17
var4    14
Name: b, dtype: int64

In [ ]:
df.loc[(df.a > 15),["b"]]

       b
var2  17
var4  14

In [ ]:
df.loc[(df.a>15),["b"]]

pandas.core.frame.DataFrame

In [ ]:
#df[satır indesklemesi,sütun indekslemesi]

**join**

In [ ]:
df1 = pd.DataFrame([1,2,3,4])
df2 = pd.DataFrame([7,8,9,10])

In [ ]:
df1

   0
0  1
1  2
2  3
3  4

In [ ]:
df2

    0
0   7
1   8
2   9
3  10

In [ ]:
df3=pd.concat([df1,df2])
df3

    0
0   1
1   2
2   3
3   4
0   7
1   8
2   9
3  10

In [ ]:
df3_yeni = pd.concat([df1,df2],axis=1,ignore_index=True)
df3_yeni.columns = ["A","B"]
df3_yeni

   A   B
0  1   7
1  2   8
2  3   9
3  4  10

In [ ]:
df3 = pd.concat([df1,df2],ignore_index=True)
df3.columns = ["A"]

In [ ]:
df3

    A
0   1
1   2
2   3
3   4
4   7
5   8
6   9
7  10

In [ ]:
df3_new=pd.concat([df1,df2],ignore_index=True)
df3_new

In [ ]:
df3_new.columns=["col1"]

In [ ]:
df3_new.columns

In [ ]:
df3_new

In [ ]:
df3_v_new=pd.concat([df1,df2],axis=1,ignore_index=True)
df3_v_new

   0   1
0  1   7
1  2   8
2  3   9
3  4  10

In [ ]:
df3_v_new.columns = ["Oda Sayısı","Bina Yaşı"]
df3_v_new

   Oda Sayısı  Bina Yaşı
0           1          7
1           2          8
2           3          9
3           4         10

In [ ]:
df1_new=pd.DataFrame(np.random.randint(1,10,(5,4)),columns=["col1","col2","col3","col4"])
df2_new=pd.DataFrame(np.random.randint(1,10,(5,4)),columns=["kol1","kol2","kol3","kol4"])

In [ ]:
df1_new

In [ ]:
df2_new

In [ ]:
df3_new=pd.concat([df1_new,df2_new])
df3_new

In [ ]:
df3_new2=pd.concat([df1_new,df2_new],axis=1,ignore_index=True)

In [ ]:
df3_new2

In [ ]:
df1_new=pd.DataFrame(np.random.randint(1,10,size=(2,2)),columns=["a","b"])
df2_new=pd.DataFrame(np.random.randint(1,15,size=(2,2)),columns=["b","c"])

In [ ]:
df1_new

   a  b
0  5  9
1  2  1

In [ ]:
df2_new

   b  c
0  7  8
1  2  5

In [ ]:
pd.concat([df1_new,df2_new])

     a  b    c
0  5.0  9  NaN
1  2.0  1  NaN
0  NaN  7  8.0
1  NaN  2  5.0

In [ ]:
pd.concat([df1_new,df2_new], join="inner")

   b
0  9
1  1
0  7
1  2

In [ ]:
pd.concat([df1_new,df2_new],axis = 1)

   a  b  b  c
0  5  9  7  8
1  2  1  2  5

In [ ]:
?pd.concat

In [ ]:
s1={"calisanlar":["Çakır","Polat","Laz Ziya"],"meslek":["Güvenlik","Diplomat","İş Adamı"]}
s2={"calisanlar":["Polat","Çakır","Laz Ziya"],"boy":["1.75","1.76","1.77"]}

In [ ]:
d1=pd.DataFrame(s1)
d2=pd.DataFrame(s2)

In [ ]:
d1

  calisanlar    meslek
0      Çakır  Güvenlik
1      Polat  Diplomat
2   Laz Ziya  İş Adamı

In [ ]:
d2

  calisanlar   boy
0      Polat  1.75
1      Çakır  1.76
2   Laz Ziya  1.77

In [ ]:
pd.merge(d1,d2)

  calisanlar    meslek   boy
0      Çakır  Güvenlik  1.76
1      Polat  Diplomat  1.75
2   Laz Ziya  İş Adamı  1.77

In [ ]:
SELECT * FROM T1 JOIN T2 ON T1.FKID = T2.ID

In [ ]:
pd.merge(d1,d2, on="calisanlar")

  calisanlar    meslek   boy
0      Çakır  Güvenlik  1.76
1      Polat  Diplomat  1.75
2   Laz Ziya  İş Adamı  1.77

In [ ]:
s1={"kisiler":["Obi-Wan Kenobi","Han Solo","Darth Vader","Anakin Skywalker"],"kilic":["Mavi","-","Kırmızı","Mavi"]}
s2={"kisiler":["Obi-Wan Kenobi","Han Solo","Darth Vader","Anakin Skywalker"],"taraf":["iyi","iyi","kötü","iyi"]}
s3={"taraf":["iyi","kötü"],"yönetici":["Yoda","Palpatine"]}

In [ ]:
d1=pd.DataFrame(s1)
d2=pd.DataFrame(s2)
d3=pd.DataFrame(s3)

In [ ]:
df_n=pd.merge(d1,d2)

In [ ]:
df_n

            kisiler    kilic taraf
0    Obi-Wan Kenobi     Mavi   iyi
1          Han Solo        -   iyi
2       Darth Vader  Kırmızı  kötü
3  Anakin Skywalker     Mavi   iyi

In [ ]:
pd.merge(df_n,d3)

            kisiler    kilic taraf   yönetici
0    Obi-Wan Kenobi     Mavi   iyi       Yoda
1          Han Solo        -   iyi       Yoda
2  Anakin Skywalker     Mavi   iyi       Yoda
3       Darth Vader  Kırmızı  kötü  Palpatine

**Toplulaştırma**

In [ ]:
import seaborn as sns

In [ ]:
?sns.load_dataset()

In [ ]:
import seaborn as sns
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [ ]:
df.shape
#1035 gözlem ve 6 değişken

(1035, 6)

In [ ]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [ ]:
df.mass.mean()

2.6381605847953233

In [ ]:
df.mass.var()

14.58183312700122

In [ ]:
df.mass.count()

513

In [ ]:
df.mass.median()

1.26

In [ ]:
df.mass.std()

3.8186166509616046

In [ ]:
df.describe().T

                 count         mean  ...       75%       max
number          1035.0     1.785507  ...     2.000       7.0
orbital_period   992.0  2002.917596  ...   526.005  730000.0
mass             513.0     2.638161  ...     3.040      25.0
distance         808.0   264.069282  ...   178.500    8500.0
year            1035.0  2009.070531  ...  2012.000    2014.0

[5 rows x 8 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

**Gruplama**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
s1={"kisiler":["Obi-Wan Kenobi","Han Solo","Leia Organa","Luke Skywalker","Darth Vader","Anakin Skywalker","Count Dooku"],"kilic":["Mavi","-","-","Yeşil","Kırmızı","Mavi","Kırmızı"]}
s2={"kisiler":["Obi-Wan Kenobi","Han Solo","Leia Organa","Luke Skywalker","Darth Vader","Anakin Skywalker","Count Dooku"],"baglanti":["Cumhuriyet","Asiler","Asiler","Asiler","İmparatorluk","Cumhuriyet","Ayrılıkçılar"]}
s3={"kisiler":["Obi-Wan Kenobi","Han Solo","Leia Organa","Luke Skywalker","Darth Vader","Anakin Skywalker","Count Dooku"],"yas":[38,29,19,19,42,22,83]}
s4={"kisiler":["Obi-Wan Kenobi","Han Solo","Leia Organa","Luke Skywalker","Darth Vader","Anakin Skywalker","Count Dooku"],"boy":[180,174,165,175,203,183,185]}
s5={"baglanti":["Cumhuriyet","Ayrılıkçılar","Asiler","İmparatorluk"],"usta":["Yoda","Palpatine","Mon Mothma","Palpatine"]}
s6={"baglanti":["Cumhuriyet","Ayrılıkçılar","Asiler","İmparatorluk"],"taraf":["İyi","Kötü","İyi","Kötü"]}

In [ ]:
d1=pd.DataFrame(s1)
d2=pd.DataFrame(s2)
d3=pd.DataFrame(s3)
d4=pd.DataFrame(s4)
d5=pd.DataFrame(s5)
d6=pd.DataFrame(s6)

In [ ]:
df_m1=pd.merge(d1,d2)

In [ ]:
df_m2=pd.merge(df_m1,d3)

In [ ]:
df_m3=pd.merge(df_m2,d4)

In [ ]:
df_m4=pd.merge(df_m3,d5)

In [ ]:
df_m5=pd.merge(df_m4,d6)

In [ ]:
df_m5

            kisiler    kilic      baglanti  yas  boy        usta taraf
0    Obi-Wan Kenobi     Mavi    Cumhuriyet   38  180        Yoda   İyi
1  Anakin Skywalker     Mavi    Cumhuriyet   22  183        Yoda   İyi
2          Han Solo        -        Asiler   29  174  Mon Mothma   İyi
3       Leia Organa        -        Asiler   19  165  Mon Mothma   İyi
4    Luke Skywalker    Yeşil        Asiler   19  175  Mon Mothma   İyi
5       Darth Vader  Kırmızı  İmparatorluk   42  203   Palpatine  Kötü
6       Count Dooku  Kırmızı  Ayrılıkçılar   83  185   Palpatine  Kötü

In [ ]:
df_m5.groupby("taraf")["yas"].mean()

taraf
Kötü    62.5
İyi     25.4
Name: yas, dtype: float64

In [ ]:
df_m5.groupby("taraf")["yas"].mean()

In [ ]:
df_m5.groupby("kilic")["yas"].std()

kilic
-           7.071068
Kırmızı    28.991378
Mavi       11.313708
Yeşil            NaN
Name: yas, dtype: float64

In [ ]:
df_m5.groupby("usta")["boy"].mean()

usta
Mon Mothma    171.333333
Palpatine     194.000000
Yoda          181.500000
Name: boy, dtype: float64

In [ ]:
df_m5.groupby("baglanti").describe().T

baglanti       Asiler  Ayrılıkçılar  Cumhuriyet  İmparatorluk
yas count    3.000000           1.0    2.000000           1.0
    mean    22.333333          83.0   30.000000          42.0
    std      5.773503           NaN   11.313708           NaN
    min     19.000000          83.0   22.000000          42.0
    25%     19.000000          83.0   26.000000          42.0
    50%     19.000000          83.0   30.000000          42.0
    75%     24.000000          83.0   34.000000          42.0
    max     29.000000          83.0   38.000000          42.0
boy count    3.000000           1.0    2.000000           1.0
    mean   171.333333         185.0  181.500000         203.0
    std      5.507571           NaN    2.121320           NaN
    min    165.000000         185.0  180.000000         203.0
    25%    169.500000         185.0  180.750000         203.0
    50%    174.000000         185.0  181.500000         203.0
    75%    174.500000         185.0  182.250000         203.0
    max    175.000000         185.0  183.000000         203.0

In [ ]:
df_m5.groupby("taraf")["yas"].describe()

In [ ]:
df_m5.groupby("taraf").aggregate([np.mean,np.min,np.median,np.max]).T

taraf        Kötü    İyi
yas mean     62.5   25.4
    amin     42.0   19.0
    median   62.5   22.0
    amax     83.0   38.0
boy mean    194.0  175.4
    amin    185.0  165.0
    median  194.0  175.0
    amax    203.0  183.0

**filter**
Karmaşık filtreleme yapmayı sağlar.

In [ ]:
df_m5

In [ ]:
df_m5.filter(like="y",axis=1)

In [ ]:
df_m5.filter(like="i",axis=1)

In [ ]:
def filter_fonksiyon(x):
  return x["yas"].mean()>60

In [ ]:
df_m5.groupby("taraf")["yas"].mean()

taraf
Kötü    62.5
İyi     25.4
Name: yas, dtype: float64

In [ ]:
df_m5

            kisiler    kilic      baglanti  yas  boy        usta taraf
0    Obi-Wan Kenobi     Mavi    Cumhuriyet   38  180        Yoda   İyi
1  Anakin Skywalker     Mavi    Cumhuriyet   22  183        Yoda   İyi
2          Han Solo        -        Asiler   29  174  Mon Mothma   İyi
3       Leia Organa        -        Asiler   19  165  Mon Mothma   İyi
4    Luke Skywalker    Yeşil        Asiler   19  175  Mon Mothma   İyi
5       Darth Vader  Kırmızı  İmparatorluk   42  203   Palpatine  Kötü
6       Count Dooku  Kırmızı  Ayrılıkçılar   83  185   Palpatine  Kötü

In [ ]:
df_m5.groupby("baglanti")["yas"].mean()

baglanti
Asiler          22.333333
Ayrılıkçılar    83.000000
Cumhuriyet      30.000000
İmparatorluk    42.000000
Name: yas, dtype: float64

In [ ]:
df_m5.groupby("baglanti").filter(lambda x: x["yas"].mean() > 60)

       kisiler    kilic      baglanti  yas  boy       usta taraf
6  Count Dooku  Kırmızı  Ayrılıkçılar   83  185  Palpatine  Kötü

In [ ]:
df_m5["std"]=df_m5["yas"].std()

In [ ]:
df_m5 #kendime not buna bak

In [ ]:
df_m5.groupby("taraf")["yas"].std()

**transform**

In [ ]:
df_m5["temp"] = df_m5["yas"]

In [ ]:
df_m5

            kisiler    kilic      baglanti  yas  boy        usta taraf  temp
0    Obi-Wan Kenobi     Mavi    Cumhuriyet   38  180        Yoda   İyi    38
1  Anakin Skywalker     Mavi    Cumhuriyet   22  183        Yoda   İyi    22
2          Han Solo        -        Asiler   29  174  Mon Mothma   İyi    29
3       Leia Organa        -        Asiler   19  165  Mon Mothma   İyi    19
4    Luke Skywalker    Yeşil        Asiler   19  175  Mon Mothma   İyi    19
5       Darth Vader  Kırmızı  İmparatorluk   42  203   Palpatine  Kötü    42
6       Count Dooku  Kırmızı  Ayrılıkçılar   83  185   Palpatine  Kötü    83

In [ ]:
df_m5["temp"] = df_m5["temp"]*10

In [ ]:
df_m5

            kisiler    kilic      baglanti  yas  boy        usta taraf
0    Obi-Wan Kenobi     Mavi    Cumhuriyet   38  180        Yoda   İyi
1  Anakin Skywalker     Mavi    Cumhuriyet   22  183        Yoda   İyi
2          Han Solo        -        Asiler   29  174  Mon Mothma   İyi
3       Leia Organa        -        Asiler   19  165  Mon Mothma   İyi
4    Luke Skywalker    Yeşil        Asiler   19  175  Mon Mothma   İyi
5       Darth Vader  Kırmızı  İmparatorluk   42  203   Palpatine  Kötü
6       Count Dooku  Kırmızı  Ayrılıkçılar   83  185   Palpatine  Kötü

Bazı durumlarda dönüşüm işlemlerini bizim tanımlamamız gerekebilir.

In [ ]:
df_m5.drop(columns=["temp"],inplace=True, axis=1)

In [ ]:
def fonksyion(x):
  return x - x.mean()

In [ ]:
df_m5.transform(fonksyion)

In [ ]:
df_m5.dtypes

kisiler     object
kilic       object
baglanti    object
yas          int64
boy          int64
usta        object
taraf       object
dtype: object

In [ ]:
numeric_values = df_m5.select_dtypes(include=["int64"])

In [ ]:
numeric_values

   yas  boy
0   38  180
1   22  183
2   29  174
3   19  165
4   19  175
5   42  203
6   83  185

In [ ]:
numeric_values.transform(lambda x: x - x.mean())

    yas        boy
0   2.0  -0.714286
1 -14.0   2.285714
2  -7.0  -6.714286
3 -17.0 -15.714286
4 -17.0  -5.714286
5   6.0  22.285714
6  47.0   4.285714

In [ ]:
numeric_values.transform(lambda x:x - x.mean() / x.std())

        yas         boy
0  36.40901  164.775969
1  20.40901  167.775969
2  27.40901  158.775969
3  17.40901  149.775969
4  17.40901  159.775969
5  40.40901  187.775969
6  81.40901  169.775969

In [ ]:
df_m5

**apply**

In [ ]:
numeric_values

   yas  boy
0   38  180
1   22  183
2   29  174
3   19  165
4   19  175
5   42  203
6   83  185

In [ ]:
numeric_values.apply(np.sum)

yas     252
boy    1265
dtype: int64

In [ ]:
numeric_values.apply(np.mean)

yas     36.000000
boy    180.714286
dtype: float64

In [ ]:
df_m5

In [ ]:
df_m5.groupby("taraf").aggregate([np.mean])

        yas    boy
       mean   mean
taraf
Kötü   62.5  194.0
İyi    25.4  175.4

In [ ]:
df_m5.groupby("taraf").apply(np.mean)

        yas    boy
taraf
Kötü   62.5  194.0
İyi    25.4  175.4

In [ ]:
df_m5.groupby("kilic").apply(np.mean)

In [ ]:
df_m5.groupby("kilic")["boy"].apply(np.std)

**Pivot Tablolar**

In [ ]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

In [ ]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
titanic.groupby(["sex","class"])[["survived"]].aggregate(np.mean)

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [ ]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
titanic.pivot_table("survived", index="sex", columns="class", aggfunc=np.sum)

class   First  Second  Third
sex
female     91      70     72
male       45      17     47

In [ ]:
titanic.pivot_table("survived", index="sex", columns="class", aggfunc=np.std)

class      First    Second     Third
sex
female  0.176716  0.271448  0.501745
male    0.484484  0.365882  0.342694

In [ ]:
titanic.pivot_table("survived",index="sex",columns="class",aggfunc=np.mean) #aggregate FUnction -> aggfunc

In [ ]:
titanic.pivot_table("survived",index="sex",columns="class",aggfunc=np.sum)

In [ ]:
titanic.pivot_table("survived",index="sex",columns="class")

In [ ]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
#sürekli bir değişkeni kategorik veriye çevirme
age = pd.cut(titanic["age"], [10,18,90])

In [ ]:
age

0      (18.0, 90.0]
1      (18.0, 90.0]
2      (18.0, 90.0]
3      (18.0, 90.0]
4      (18.0, 90.0]
           ...
886    (18.0, 90.0]
887    (18.0, 90.0]
888             NaN
889    (18.0, 90.0]
890    (18.0, 90.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64]): [(10, 18] < (18, 90]]

In [ ]:
titanic

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [ ]:
age

In [ ]:
titanic.pivot_table("survived", index = ["sex",age], columns="class",aggfunc = np.sum)

class            First  Second  Third
sex    age
female (10, 18]     10       6     11
       (18, 90]     72      54     25
male   (10, 18]      2       0      3
       (18, 90]     36       6     27

In [ ]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (10, 18]  1.000000  1.000000  0.523810
       (18, 90]  0.972973  0.900000  0.423729
male   (10, 18]  0.666667  0.000000  0.103448
       (18, 90]  0.375000  0.071429  0.133663

In [ ]:
titanic.pivot_table("survived",["sex",age],"class",aggfunc=np.sum)